app/views/users/characters.html.erb

<h1><%= @user.name %></h1>
<% @user.characters.each do |char| %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ?  [["user_id", 1]]