app/views/users/roster.html.erb

      <% @users.each do |user| %>
        <% mc = user.main_char || user.characters.first %>
---
SELECT  "characters".* FROM "characters" WHERE "characters"."user_id" = ? ORDER BY "characters"."id" ASC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]