app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def characters
  	@user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def roster
  	@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "AlphaRahl"], ["LIMIT", 1]]
---
  def login_path
  	login_params = params[:session]
  	@current_user = User.where(name: login_params[:char_name]).first